**Terraform Format and Style 🖌**
`success`

**Terraform Initialization ⚙️**
`success`

**Terraform Validate ✅**
`success`

**Terraform Plan 📖**
`success`

<details><summary>Show Plan</summary>

```
terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mdata.hcloud_image.base: Refreshing state...[0m
[0m[1mhcloud_floating_ip.bastion: Refreshing state... [id=369139][0m
[0m[1mhcloud_ssh_key.default: Refreshing state... [id=2415045][0m
[0m[1mhcloud_network.internal: Refreshing state... [id=389204][0m
[0m[1mdata.google_dns_managed_zone.mhnet: Refreshing state... [id=projects/mhnet-home/managedZones/mhnet-me][0m
[0m[1mhcloud_network_subnet.internal: Refreshing state... [id=389204-10.0.0.0/24][0m
[0m[1mhcloud_server.bastion: Refreshing state... [id=8683930][0m
[0m[1mhcloud_floating_ip_assignment.bastion: Refreshing state... [id=369139][0m
[0m[1mhcloud_server_network.bastion: Refreshing state... [id=8683930-389204][0m
[0m[1mgoogle_dns_record_set.bastion: Refreshing state... [id=mhnet-me/bastion.mhnet.me./A][0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # google_dns_record_set.bastion[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_dns_record_set" "bastion" {
      [33m~[0m [0m[1m[0mid[0m[0m           = "mhnet-me/bastion.mhnet.me./A" [33m->[0m [0m(known after apply)
        [1m[0mmanaged_zone[0m[0m = "mhnet-me"
      [33m~[0m [0m[1m[0mname[0m[0m         = "bastion.mhnet.me." [33m->[0m [0m"bastion.fsn1.mhnet.me." [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mproject[0m[0m      = "mhnet-home" [33m->[0m [0m(known after apply)
        [1m[0mrrdatas[0m[0m      = [
            "10.0.0.2",
        ]
        [1m[0mttl[0m[0m          = 300
        [1m[0mtype[0m[0m         = "A"
    }

[1m  # hcloud_floating_ip_assignment.bastion[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_floating_ip_assignment" "bastion" {
        [1m[0mfloating_ip_id[0m[0m = 369139
      [33m~[0m [0m[1m[0mid[0m[0m             = "369139" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mserver_id[0m[0m      = 8683930 [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
    }

[1m  # hcloud_network.internal[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "hcloud_network" "internal" {
        [1m[0mid[0m[0m       = "389204"
        [1m[0mip_range[0m[0m = "10.0.0.0/16"
        [1m[0mlabels[0m[0m   = {}
      [33m~[0m [0m[1m[0mname[0m[0m     = "mhnet" [33m->[0m [0m"internal"
    }

[1m  # hcloud_server.bastion[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server" "bastion" {
      [32m+[0m [0m[1m[0mbackup_window[0m[0m = (known after apply)
        [1m[0mbackups[0m[0m       = false
      [33m~[0m [0m[1m[0mdatacenter[0m[0m    = "fsn1-dc14" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m            = "8683930" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mimage[0m[0m         = "26591051" [33m->[0m [0m"26641539" [31m# forces replacement[0m[0m
      [33m~[0m [0m[1m[0mipv4_address[0m[0m  = "168.119.246.101" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mipv6_address[0m[0m  = "2a01:4f8:1c17:401f::1" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mipv6_network[0m[0m  = "2a01:4f8:1c17:401f::/64" [33m->[0m [0m(known after apply)
        [1m[0mkeep_disk[0m[0m     = false
      [31m-[0m [0m[1m[0mlabels[0m[0m        = {} [90m->[0m [0m[90mnull[0m[0m
        [1m[0mlocation[0m[0m      = "fsn1"
      [33m~[0m [0m[1m[0mname[0m[0m          = "bastion.mhnet.me" [33m->[0m [0m"bastion.fsn1.mhnet.me."
        [1m[0mserver_type[0m[0m   = "cx11"
        [1m[0mssh_keys[0m[0m      = [
            "2415045",
        ]
      [33m~[0m [0m[1m[0mstatus[0m[0m        = "running" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0muser_data[0m[0m     = "5VSDHLjjvq6u84bgOaQNPezFwzc=" [33m->[0m [0m"KZ3sOnKiHF2f+poklFiZfNu3Ksw=" [31m# forces replacement[0m[0m
    }

[1m  # hcloud_server_network.bastion[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "hcloud_server_network" "bastion" {
      [31m-[0m [0m[1m[0malias_ips[0m[0m   = [] [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mid[0m[0m          = "8683930-389204" [33m->[0m [0m(known after apply)
        [1m[0mip[0m[0m          = "10.0.0.2"
      [33m~[0m [0m[1m[0mmac_address[0m[0m = "86:00:00:80:53:b0" [33m->[0m [0m(known after apply)
        [1m[0mnetwork_id[0m[0m  = 389204
      [33m~[0m [0m[1m[0mserver_id[0m[0m   = 8683930 [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
    }

[0m[1mPlan:[0m 4 to add, 1 to change, 4 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```
</details>
Pusher: @mhutter
Action: `pull_request`